## **<span style="color:red">데이터를 추출하는 다양한 방법</span>** ## 
***
#### **[ ] 이용하기** ####

In [1]:
# 조건을 충족하는 행 추출하기
import pandas as pd
df_raw=pd.read_csv("exam.csv")
df= df_raw.head(10)
df

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
5   6       2    50       89       98
6   7       2    80       90       45
7   8       2    90       78       25
8   9       3    20       98       15
9  10       3    50       98       45

In [2]:
# nclass 추출
df["nclass"]

# nclass가 1인지 확인
df["nclass"]==1

0     True
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9    False
Name: nclass, dtype: bool

In [3]:
df[df["nclass"]==1] # nclass가 1이면 추출

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [4]:
# nclass가 1이면서 수학 점수가 50점 이상
df[(df["nclass"]==1)&(df["math"]>=50)]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60

In [5]:
# 수학 점수가 50점 미만이거나 영어 점수가 50점 미만
df[(df["math"]<50)|(df["english"]<50)]

   id  nclass  math  english  science
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65
8   9       3    20       98       15

#### **df.loc[ ] 이용하기** ####

In [6]:
df=pd.DataFrame({"var1":[1,2,3],
                "var2":[4,5,6]},
                index=["kim","lee","park"])
df

      var1  var2
kim      1     4
lee      2     5
park     3     6

In [7]:
# kim행 추출
df.loc["kim"]

var1    1
var2    4
Name: kim, dtype: int64

In [8]:
# 여러 행 추출
df.loc[["kim","park"]]

      var1  var2
kim      1     4
park     3     6

In [9]:
# lee행의 var1열 추출
df.loc["lee","var1"]

2

In [10]:
# kim, lee행의 var2열 추출
df.loc[["kim","lee"],"var2"]

kim    4
lee    5
Name: var2, dtype: int64

In [11]:
# 모든 행의 var1열 추출
df.loc[:,"var1"]

kim     1
lee     2
park    3
Name: var1, dtype: int64

In [12]:
# 인덱스 번호를 지정해 행 추출하기
df=df_raw.copy()

# 시리즈로 추출
df.loc[0]

# 데이터 프레임으로 추출
df.loc[[0,3,5]]

   id  nclass  math  english  science
0   1       1    50       98       50
3   4       1    30       98       58
5   6       2    50       89       98

In [13]:
# 0~3행 추출, 리스트와 달리 끝값 포함
df.loc[0:3]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [14]:
# 조건을 충족하는 행 추출

# nclass가 1이면 추출
df.loc[df["nclass"]==1]

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [15]:
# nclass가 1인 행의 math, english열 추출
df.loc[df["nclass"]==1,["math","english"]]

   math  english
0    50       98
1    60       97
2    45       86
3    30       98

#### **df.iloc[ ] 이용하기** ####
- df.loc[ ]와 달리, 인덱스가 문자열이라도 인덱스 번호로 행을 추출할 수 있음
- df.loc[ ]와 달리, 조건을 지정해 행을 추출할 수 없음

In [16]:
# 1~4행 추출
df.iloc[1:5] # 리스트 처럼 끝값 포함하지 않음

   id  nclass  math  english  science
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65